In [25]:
import pandas as pd
from constants import *

In [26]:
data_df = pd.read_csv("data.csv")
data_df.head()

,isbn,book_title,num_printed,num_pages,price,edition,print_series,category_id,category_name,publisher_id,publisher_name,city,manager_name,publisher_revenue,author_id,author_name,author_age,author_revenue,publish_date
0,3629268805,book_title00001,35000,1208,129.1,6,54,40,Satire,1001,publisher_name1001,428,manager_name4821,1807400.0,1001,author_name1001,72,2711100.0,2004-12-15 00:00:00
1,3911691385,book_title00002,42000,846,184.9,4,6,19,Fantasy,1001,publisher_name1001,428,manager_name4821,3106320.0,1002,author_name1002,50,4659480.0,2002-10-13 00:00:00
2,5391725720,book_title00003,48000,111,150.2,8,16,37,Horror Fiction,1002,publisher_name1002,356,manager_name2073,2883840.0,1003,author_name1003,35,4325760.0,2022-08-18 00:00:00
3,2247650772,book_title00004,11000,514,39.6,7,37,28,Action Fiction,1003,publisher_name1003,265,manager_name1205,174240.0,1003,author_name1003,35,261360.0,2021-07-18 00:00:00
4,9831162865,book_title00005,50000,1569,53.6,5,66,40,Satire,1003,publisher_name1003,265,manager_name1205,1072000.0,1003,author_name1003,35,1608000.0,2019-09-13 00:00:00

In [27]:
books_df = data_df[["isbn", "book_title", "num_pages", "price", "edition", "print_series", "category_id"]].copy()
books_df.rename(columns={"book_title": "title",
                         "num_pages": "pages",
                         "edition": "edition_num"},
                inplace=True)
books_df.to_csv("data/books.csv", index=False)
print(books_df.shape)
books_df.head()

(12000, 7)

,isbn,title,pages,price,edition_num,print_series,category_id
0,3629268805,book_title00001,1208,129.1,6,54,40
1,3911691385,book_title00002,846,184.9,4,6,19
2,5391725720,book_title00003,111,150.2,8,16,37
3,2247650772,book_title00004,514,39.6,7,37,28
4,9831162865,book_title00005,1569,53.6,5,66,40

In [28]:
publishers_df = data_df[["publisher_id", "publisher_name", "city", "manager_name"]].copy().drop_duplicates()
total_printed_books = data_df.groupby("publisher_id")["num_printed"].sum().reset_index()
total_book_revenue = data_df.groupby("publisher_id")["publisher_revenue"].sum().reset_index()
publishers_df = pd.merge(publishers_df, total_printed_books, on="publisher_id", how="left", suffixes=("", "_total_printed"))
publishers_df = pd.merge(publishers_df, total_book_revenue, on="publisher_id", how="left", suffixes=("", "_total_revenue"))
publishers_df.rename(columns={"publisher_id": "id",
                              "num_printed": "total_printed",
                              "publisher_revenue": "total_revenue"},
                     inplace=True)
publishers_df.to_csv("data/publishers.csv", index=False)
print(publishers_df.shape)
publishers_df.head()

(5000, 6)

,id,publisher_name,city,manager_name,total_printed,total_revenue
0,1001,publisher_name1001,428,manager_name4821,77000,4913720.0
1,1002,publisher_name1002,356,manager_name2073,48000,2883840.0
2,1003,publisher_name1003,265,manager_name1205,130000,3223480.0
3,1004,publisher_name1004,223,manager_name2219,64000,2072320.0
4,1005,publisher_name1005,253,manager_name1557,162000,4894400.0

In [29]:
authors_df = data_df[["author_id", "author_name", "author_age"]].copy().drop_duplicates()
total_book_revenue = data_df.groupby("author_id")["author_revenue"].sum().reset_index()
authors_df = pd.merge(authors_df, total_book_revenue, on="author_id", how="left", suffixes=("", "_total_revenue"))
authors_df.rename(columns={"author_id": "id",
                           "author_age": "age", 
                           "author_revenue": "total_revenue"},
                  inplace=True)
authors_df.to_csv("data/authors.csv", index=False)
print(authors_df.shape)
authors_df.head()

(8999, 4)

     id      author_name  age  total_revenue
0  1001  author_name1001   72      2711100.0
1  1002  author_name1002   50      4659480.0
2  1003  author_name1003   35      7743300.0
3  1004  author_name1004   73      1417680.0
4  1005  author_name1005   42      1453860.0

In [30]:
author_book_df = data_df[["isbn", "author_id", "author_revenue"]].copy()
author_book_df.to_csv("data/authBook.csv", index=False)
print(author_book_df.shape)
author_book_df.head()

(12000, 3)

         isbn  author_id  author_revenue
0  3629268805       1001       2711100.0
1  3911691385       1002       4659480.0
2  5391725720       1003       4325760.0
3  2247650772       1003        261360.0
4  9831162865       1003       1608000.0

In [31]:
pub_book_df = data_df[["isbn", "publisher_id", "publish_date", "publisher_revenue"]].copy()
pub_book_df.to_csv("data/pubBook.csv", index=False)
print(data_df["publish_date"].dtype)
print(pub_book_df.shape)
pub_book_df.head()

object
(12000, 4)

         isbn  publisher_id         publish_date  publisher_revenue
0  3629268805          1001  2004-12-15 00:00:00          1807400.0
1  3911691385          1001  2002-10-13 00:00:00          3106320.0
2  5391725720          1002  2022-08-18 00:00:00          2883840.0
3  2247650772          1003  2021-07-18 00:00:00           174240.0
4  9831162865          1003  2019-09-13 00:00:00          1072000.0

In [32]:
category_df = data_df[["category_id", "category_name"]].drop_duplicates().sort_values(by="category_id").reset_index(drop=True)
category_df.rename(columns={"category_id": "id"}, 
                   inplace=True)
category_df.to_csv("data/category.csv", index=False)
print(category_df.shape)
category_df.head()

(40, 2)

   id       category_name
0   1             Fiction
1   2           Narrative
2   3               Novel
3   4  Historical Fiction
4   5     Science Fiction